/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   main.cpp                                           :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: sabdulki <sabdulki@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2024/08/29 01:08:37 by sabdulki          #+#    #+#             */
/*   Updated: 2024/09/04 14:18:15 by sabdulki         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "Harl.hpp"

/*
В системах, где требуется реакция на события (например, в игровых движках или системах реального времени), 
указатели на функции-члены позволяют легко связывать события с соответствующими методами объектов.
*/

int main()
{
	Harl newHarl;
	
	newHarl.complain("DEBUG");
	newHarl.complain("INFO");
	newHarl.complain("WARNING");
	newHarl.complain("ERROR");
	newHarl.complain("smth");
	
	return (0);
}
