/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   main.cpp                                           :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: sabdulki <sabdulki@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2024/08/29 01:08:37 by sabdulki          #+#    #+#             */
/*   Updated: 2024/08/29 01:44:55 by sabdulki         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "Harl.hpp"

/*
В системах, где требуется реакция на события (например, в игровых движках или системах реального времени), 
указатели на функции-члены позволяют легко связывать события с соответствующими методами объектов.
*/